
use [C:\USERS\JEKAR\DESKTOP\КПУ\ОГАРЕНКО\ЗАДАНИЯ\10\APPRYABCHUK\APPRYABCHUK\ХЛІБРЯБЧУК.MDF];


	SET IDENTITY_INSERT [dbo].[Товари] ON;
	INSERT INTO [dbo].[Товари] ([Код_товару], [Товар], [Ціна], [Ціна_закупівлі]) 
	VALUES (1, N'Хліб Український', 10.50, 9.30)

SET IDENTITY_INSERT [dbo].[Товари] ON;
INSERT INTO [dbo].[Товари] ([Код_товару], [Товар], [Ціна], [Ціна_закупівлі]) 
VALUES (2, N'Батон Молочний', 10.20, 9.10)

SET IDENTITY_INSERT [dbo].[Товари] ON;
INSERT INTO [dbo].[Товари] ([Код_товару], [Товар], [Ціна], [Ціна_закупівлі]) 
VALUES (3, N'Булка з маком', 9.80, 8.65)





use [C:\USERS\JEKAR\DESKTOP\КПУ\ОГАРЕНКО\ЗАДАНИЯ\10\APPRYABCHUK\APPRYABCHUK\ХЛІБРЯБЧУК.MDF];


SET IDENTITY_INSERT [dbo].[Виробники] OFF;
INSERT INTO [dbo].[Виробники] ([Виробник], [Адреса], [Телефон]) VALUES (N'Х/з "Салтівський"', N'вул. Гв. Широнінців, 1', '(057)710-50-40')

SET IDENTITY_INSERT [dbo].[Виробники] OFF;
INSERT INTO [dbo].[Виробники] ([Виробник], [Адреса], [Телефон]) VALUES (N'Х/з "Кулиничі"', N'смт Кулиничі, вул. Шкільна, 18', '(0572)62-51-37)')




use [C:\USERS\JEKAR\DESKTOP\КПУ\ОГАРЕНКО\ЗАДАНИЯ\10\APPRYABCHUK\APPRYABCHUK\ХЛІБРЯБЧУК.MDF];


SET IDENTITY_INSERT [dbo].[Виробники] ON;
INSERT INTO [dbo].[Виробники] ([Код_виробника], [Виробник], [Адреса], [Телефон]) VALUES (1, N'Х/з "Салтівський"', N'вул. Гв. Широнінців, 1', '(057)710-50-40');

SET IDENTITY_INSERT [dbo].[Виробники] ON;
INSERT INTO [dbo].[Виробники] ([Код_виробника], [Виробник], [Адреса], [Телефон]) VALUES (2, N'Х/з "Кулиничі"', N'смт Кулиничі, вул. Шкільна, 18', '(0572)62-51-37)');










use [C:\USERS\JEKAR\DESKTOP\КПУ\ОГАРЕНКО\ЗАДАНИЯ\10\APPRYABCHUK\APPRYABCHUK\ХЛІБРЯБЧУК.MDF];



SET IDENTITY_INSERT [dbo].[Продажі] ON; 
INSERT INTO [dbo].[Продажі] (Код_продажу,[Код_виробника], Код_товару, Кількість, Дата) VALUES (1, 1, 1, 200, '01.09.2018');

SET IDENTITY_INSERT [dbo].[Продажі] ON;
INSERT INTO [dbo].[Продажі] (Код_продажу,[Код_виробника], Код_товару, Кількість, Дата) VALUES (2, 1, 2, 250, '01.09.2018');

SET IDENTITY_INSERT [dbo].[Продажі] ON;
INSERT INTO [dbo].[Продажі] (Код_продажу,[Код_виробника], Код_товару, Кількість, Дата) VALUES (3, 2, 1, 150, '01.09.2018');

SET IDENTITY_INSERT [dbo].[Продажі] ON;
INSERT INTO [dbo].[Продажі] (Код_продажу,[Код_виробника], Код_товару, Кількість, Дата) VALUES (4, 2, 3, 180, '01.09.2018');

SET IDENTITY_INSERT [dbo].[Продажі] ON;
INSERT INTO [dbo].[Продажі] (Код_продажу,[Код_виробника], Код_товару, Кількість, Дата) VALUES (5, 1, 1, 220, '02.09.2018');

SET IDENTITY_INSERT [dbo].[Продажі] ON;
INSERT INTO [dbo].[Продажі] (Код_продажу,[Код_виробника], Код_товару, Кількість, Дата) VALUES (6, 1, 3, 170, '02.09.2018');

SET IDENTITY_INSERT [dbo].[Продажі] ON;
INSERT INTO [dbo].[Продажі] (Код_продажу,[Код_виробника], Код_товару, Кількість, Дата) VALUES (7, 2, 1, 200, '02.09.2018');

SET IDENTITY_INSERT [dbo].[Продажі] ON;
INSERT INTO [dbo].[Продажі] (Код_продажу,[Код_виробника], Код_товару, Кількість, Дата) VALUES (8, 2, 2, 100, '02.09.2018');















use [C:\USERS\JEKAR\DESKTOP\КПУ\ОГАРЕНКО\ЗАДАНИЯ\10\PROJECT\САМОСТІЙНА_2.3\APPRYABCHUK\ХЛІБРЯБЧУК.MDF];


INSERT INTO [dbo].[Види_товарів] (Номер_виду, Назва_виду) 
VALUES (1, N'хліб')

INSERT INTO [dbo].[Види_товарів] (Номер_виду, Назва_виду) 
VALUES (2, N'батон')

INSERT INTO [dbo].[Види_товарів] (Номер_виду, Назва_виду) 
VALUES (3, N'булка')




use [C:\USERS\JEKAR\DESKTOP\КПУ\ОГАРЕНКО\ЗАДАНИЯ\10\PROJECT\САМОСТІЙНА_2.3\APPRYABCHUK\ХЛІБРЯБЧУК.MDF];


SET IDENTITY_INSERT [dbo].[Товари] ON;
INSERT INTO [dbo].[Товари] ([Код_товару], [Товар], [Ціна], [Ціна_закупівлі], Номер_виду_товара)
VALUES (1, N'Хліб Український', 10.50, 9.30, 1);


SET IDENTITY_INSERT [dbo].[Товари] ON;
INSERT INTO [dbo].[Товари] ([Код_товару], [Товар], [Ціна], [Ціна_закупівлі], Номер_виду_товара)
VALUES (2, N'Батон Молочний', 10.20, 9.10, 2);

SET IDENTITY_INSERT [dbo].[Товари] ON;
INSERT INTO [dbo].[Товари] ([Код_товару], [Товар], [Ціна], [Ціна_закупівлі], Номер_виду_товара) 
VALUES (3, N'Булка з маком', 9.80, 8.65, 3);

SET IDENTITY_INSERT [dbo].[Товари] ON;
INSERT INTO [dbo].[Товари] ([Код_товару], [Товар], [Ціна], [Ціна_закупівлі], Номер_виду_товара) 
VALUES (4, N'Булка з сиром', 9.83, 8.68, 3);


CREATE TABLE [dbo].[Виробники_Види_товарів]
(
	[Номер_Виробники_Види_товарів] INT NOT NULL PRIMARY KEY,
	[Ціна_закупівлі] MONEY NOT NULL,
	[Код_виробника] INT NOT NULL,
	[Номер_виду_товара] INT NOT NULL,

	CONSTRAINT [FK_Виробники_Виробники_Види_товарів] FOREIGN KEY ([Код_виробника]) REFERENCES [dbo].[Виробники] ([Код_виробника]) ON DELETE CASCADE,
	CONSTRAINT [FK_Види_товарів_Виробники_Види_товарів] FOREIGN KEY ([Номер_виду_товара]) REFERENCES [dbo].[Види_товарів] ([Номер_виду]) ON DELETE CASCADE
)

CREATE TABLE [dbo].[Ціни_видів_товарів_виробників] (
    [Номер] INT   NOT NULL,
    [Ціна_закупівлі]               MONEY NOT NULL,
    [Код_виробника]                INT   NOT NULL,
    [Номер_виду_товара]            INT   NOT NULL,
    PRIMARY KEY CLUSTERED ([Номер] ASC),
    CONSTRAINT [FK_Виробники_Ціни_видів_товарів_виробників] FOREIGN KEY ([Код_виробника]) REFERENCES [dbo].[Виробники] ([Код_виробника]) ON DELETE CASCADE,
    CONSTRAINT [FK_Види_товарів_Ціни_видів_товарів_виробників] FOREIGN KEY ([Номер_виду_товара]) REFERENCES [dbo].[Види_товарів] ([Номер_виду]) ON DELETE CASCADE
);

CREATE TABLE [dbo].[Товари] (
    [Код_товару]        INT        IDENTITY (1, 1) NOT NULL,
    [Товар]             NCHAR (20) NULL,
    [Ціна]              MONEY      NULL,
	[Номер_ціни_закупівлі_товару] INT NULL,
  
    PRIMARY KEY CLUSTERED ([Код_товару] ASC),

    CONSTRAINT [FK_Ціни_видів_товарів_виробників_Товари] FOREIGN KEY ([Номер_ціни_закупівлі_товару]) REFERENCES [dbo].[Ціни_видів_товарів_виробників] ([Номер]) ON DELETE CASCADE
);




INSERT INTO [dbo].[Ціни_видів_товарів_вирбника] ([Номер], [Ціна_закупівлі], [Код_виробника], [Номер_виду_товара])
VALUES (1, 9.30, 1, 1);

INSERT INTO [dbo].[Ціни_видів_товарів_вирбника] ([Номер], [Ціна_закупівлі], [Код_виробника], [Номер_виду_товара])
VALUES (2, 4.30, 1, 2);

INSERT INTO [dbo].[Ціни_видів_товарів_вирбника] ([Номер], [Ціна_закупівлі], [Код_виробника], [Номер_виду_товара])
VALUES (3, 4.30, 1, 3);


INSERT INTO [dbo].[Ціни_видів_товарів_вирбника] ([Номер], [Ціна_закупівлі], [Код_виробника], [Номер_виду_товара])
VALUES (4, 6.30, 2, 1);

INSERT INTO [dbo].[Ціни_видів_товарів_вирбника] ([Номер], [Ціна_закупівлі], [Код_виробника], [Номер_виду_товара])
VALUES (5, 7.30, 2, 2);

INSERT INTO [dbo].[Ціни_видів_товарів_вирбника] ([Номер], [Ціна_закупівлі], [Код_виробника], [Номер_виду_товара])
VALUES (6, 7.30, 2, 3);



